#+title: Regular Expressions (Regex)

[[file:../../homepage.org][Homepage]] / [[file:../../notes.org][Notes]] / [[file:../computer-science.org][Computer Science]] / Regex

* Basics
| Symbol | Description                                           |
|--------+-------------------------------------------------------|
| .      | replaces any character                                |
| ^      | matches start of string                               |
| $      | matches end of string                                 |
| *      | matches up zero or more times the preceding character |
| \      | Represent special characters                          |
| ()     | Groups regular expressions                            |
| ?      | Matches up exactly one character                      |

* Examples
#+begin_src ruby
"Do you like cats?" =~ /like/
#+end_src

#+RESULTS:
: 7

* Resources
- https://regexr.com/
- https://github.com/rulex-rs/rulex
